#include <vector>
#include <variant>
#include <string>
#include <span>
#include<algorithm>


// В C++ вектор строго типизирован. Чтобы хранить разные типы, 
// нужно использовать std::variant (C++17) или std::any.
using AnyType = std::variant<int, std::string, double>;
std::vector<AnyType> heterogeneous_list = {1, "Hi", 3.0};

/*Разница в работе: 

    Python: Список — это массив указателей на объекты в куче. Сам список хранит только адреса. 
    Поэтому ему все равно, что лежит по этим адресам (целое число, строка или объект). 
    Это удобно, но требует лишних накладных расходов на память и разыменование указателей.
    C++: std::vector хранит объекты непосредственно в непрерывном блоке памяти. 
    Из-за этого компилятор должен знать точный размер элемента на этапе компиляции. 
    Для хранения разных типов приходится использовать «обертки» (std::variant), 
    что усложняет код и требует явного извлечения типа при чтении.*/

std::vector<int> my_list = {1, 2, 3, 4, 5};

// int last = my_list[-1]; // ОШИБКА! Это не сработает.
int last = my_list.back(); // Правильный способ в C++
// или
int last_alt = my_list[my_list.size() - 1]; 

/*Разница в работе:

    Python: Оператор [] перегружен. Когда вы передаете -1, интерпретатор Python внутри проверяет: 
    «Ага, индекс отрицательный, давайте прибавим его к длине списка» (len + (-1)).
    C++: Оператор [] у std::vector — это просто чистая арифметика указателей *(begin + index). 
    Если вы передадите -1, программа обратится к памяти перед началом массива, что приведет к неопределенному поведению (segfault). 
    В C++ нет встроенной магии отрицательных индексов, нужно использовать метод .back().*/



std::vector<int> my_list2= {1, 2, 3, 4, 5};

// В C++ нет синтаксиса срезов через двоеточие.
// Нужно явно конструировать новый вектор из итераторов:
std::vector<int> first_two(my_list.begin(), my_list.begin() + 2);

// В C++20 можно использовать std::span для "взгляда" на память без копирования:

//std::span<const int> first_two_view(my_list.data(), 2); 

std::vector<int> my_list1 = {1, 2, 3, 4, 5};

// В C++ нет оператора in. Нужно использовать алгоритм std::find:
bool is_in = std::find(my_list1.begin(), my_list1.end(), 3) != my_list1.end();