#                    Списки

integer_list = [1,2,3]                           #Список целых чисел
heterogeneous_list = ["Строка", 0.1, True]      #Разнороднвй список
list_of_lists =  [integer_list, heterogeneous_list, []] #Список списков

list_length = len(integer_list)                  #Длина списка равна 3
list_sum = sum(integer_list)                     #Сумма значений в списке равна 6

x = list(range(10))           #Задает список [0, 1, ...., 9]
zero = x[0]                   ##равно 0 , т.е индекс 1-го элемента равен 0
one = x[1]                    #равно 1
nine= x[-1]                   #равно 9, по-Pythonовски взять последний элемент
eight = x[-2]                 #равно 8 по-Pythonовски взять предпоследний элемент
x[0] = 1                      #Теперь х равен [-1, 1, 2, 3, ...., 9]


first_three = x[:3]                     #Первые три равны (-1, 1, 2)
three_to_end = x[3:]                    #С третьего до конца равно (3, 4, ...., 9)
one_to_four = x[1:5]                    #С первого по четвертый равно (1, 2, 3, 4)
last_three = x[-3:]                     #Послежние три равны (7, 8, 9)
without_first_and_last = x[1:-1]        #Без первого и последнего равно (1, 2, ...., 8)
copy_of_x = x[:]                        #Копия спискаа х равна (-1, 1, 2, ...., 9)



every_third = x[::3]                   # [-1, 3, 6 ,9]
five_to_three = x[5:2:-1]              # [5, 4, 3]


#Оператор in проверяет присутствует в списке элемент или нет
1 in [1, 2, 3]        # True
0 in [1, 2, 3]        # False

# Проверка заключается в поочередном просмотре всех элементов, поэтому пользоваться им стоит только тогда,
# когда точно известно, что список является небольшим или неважно, сколько времени уйдет на проверку



# Списки дегко конкатенировать, т.е сцеплять друг с другом
# Если требуется модифицировать список прямо на месте
# то используется метод extend, который добавляет элементы из другой коллекции

x = [1, 2, 3]
x.extend([4, 5, 6]) #Теперь х равен  [1, 2, 3, 4, 5, 6]

#Если вы не хотите модифицировать список х
#то можно воспользоваться сложением списков

x = [1, 2, 3]
y = x + [4, 5, 6]   #  у равен [1, 2, 3, 4, 5, 6]; x остался без изменений


x = [1, 2, 3]      
x.append(0)        # Теперь х равен (1, 2, 3, 0)
y = x[-1]          # равно 0
z = len(x)         # равно 4

# Нередко бывает удобно распаковывать списки, когда известно, сколько в них элементов
x, y = [1, 2]     # Теперь х равен 1, у равен 2

# Однако, если с обеих сторон выражения число элементов неодинаково
# то будет выдано сообщение об ошибке значения ValueError


