# ФУНКЦИИ

#Функиця - это правило, принимающее ноль или несколько аргументова на входе и возвращающее
#соответствующий результат на выходе.

def double(x):
    """
    Когда требуетсяБ здесь размещают
    многострочный документирующий комментарий docstring
    который поясняет, что именно функция вычисляет.
    Например, указанная функция умножает входящее значение на 2
    
    """
    return x * 2

#Приминить функцию f к удинице
def apply_to_one(f):
    """Вызывает функцию f с удиницей в качестве аргумерта"""
    return f(1)

my_double = double            #Ссылка на ранее определенную функцию
x = apply_to_one(my_double)   #равно 2

#Лямбда - это анонимная функция, которая не содержит имени
y = apply_to_one(lambda x: x+4)     # равно 5

#Лямбда-выражения можно назначать переменным. Однако программисты рекомендуют все же использовать def
"""another_double = lambda x: 2 * x  так делать не надо"""
def another_double(x):
    return 2*x                    #Правильный вариант

"""Параметрам функции, можно устанавливать значения по умолчанию"""
def my_print(message = 'Мое сообщение по умолчанию'):
    return message
my_print("Привет")    # Вывод: Привет
my_print()             # Вывод: Мое сообщение по умолчанию

def full_name(first = "некто", last = "как-то там"):
    return first + " " + last

full_name("Джоэл", "Грас")     # Джоэл Грас
full_name("Джоэл")             # Джоэл как-то там
full_name(last = "Грас")        #некто Грас


#Строки 

single_quoted_string = 'наука о данных'
double_quoted_string = "наука о данных" 

#Обратная косая черта используется для кодирования специальных символов
tab_string = "\t"    #Обозначает символ табуляции
print(tab_string)    # равно 1

not_tab_string = r"\t"          #оьозначает символы '\t' and 't'
print(not_tab_string)           #равно 2

multi_string = """Это первая строка
Это втроая
А это третья"""

#В Python усть такая штука как f-строка

first_name = "Jack"
last_name = "Gras"

print(f"{first_name} {last_name}") # Jack Gras

#Исключения 

#Если происхожит какая-то ошибка, но вам нужно чтоб код не останавливался, придумали исключения
try:
    print(0/0)
except ZeroDivisionErro:
    print("Нельзя делить на ноль")
    