# Кортежи

# Кортежи - это немутируемые двоюродные брятья списков. Практически все, что можно делать со списками
# не модифицируя его, можно делать и с кортежем. Вместо квадратных скобок кортеж оформляют кругулыми
# скобкома или вообще обхоядятся без них

my_list = [1, 2]          # Задать список
my_typle = (1, 2)         # Задать кортеж
other_tuple = 3,4         # Еще один кортеж
my_list[1] = 3            # Теперь список my_list равен [1, 3]

try:
    my_typle[1] = 3
except TypeError:
    print('Кортеж нельзя модифицировать ')


#Кортежи обеспечивают удобный способ для возраста нескольких значений функций
# Функция возвращает сумму и произведение двух параметров

def sum_and_product(x, y):
    return (x + y), (x * y)

sp = sum_and_product(2, 3)            #равно (5, 6)
s, p = sum_and_product(5, 10)         #s равно 15, p равно 50


# Кортежи (и списки) также используются во множественном приваивании
x, y = 1, 2
x, y = y, x   # Обмен значениями
